;******************************************************************************
;* G3 TMS320C6x C/C++ Codegen                                     Unix v8.3.2 *
;* Date/Time created: Sat Apr  6 02:29:51 2019                                *
;******************************************************************************
	.compiler_opts --abi=eabi --array_alignment=8 --c64p_l1d_workaround=off --endian=little --hll_source=on --long_precision_bits=32 --mem_model:code=near --mem_model:const=data --mem_model:data=far_aggregates --object_format=elf --quiet --silicon_version=6600 --symdebug:dwarf --symdebug:dwarf_version=3 

;******************************************************************************
;* GLOBAL FILE PARAMETERS                                                     *
;*                                                                            *
;*   Architecture      : TMS320C66xx                                          *
;*   Optimization      : Enabled at level 3                                   *
;*   Optimizing for    : Speed                                                *
;*                       Based on options: -o3, no -ms                        *
;*   Endian            : Little                                               *
;*   Interrupt Thrshld : Disabled                                             *
;*   Data Access Model : Far Aggregate Data                                   *

	.dwattr $C$DW$268, DW_AT_decl_line(0x65)
	.dwattr $C$DW$268, DW_AT_decl_column(0x05)

$C$DW$269	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$269, DW_AT_name("CSL_PLL_UART")
	.dwattr $C$DW$269, DW_AT_const_value(0x06)
	.dwattr $C$DW$269, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/pllc/V0/csl_pllc.h")
	.dwattr $C$DW$269, DW_AT_decl_line(0x66)
	.dwattr $C$DW$269, DW_AT_decl_column(0x05)

$C$DW$270	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$270, DW_AT_name("CSL_PLL_DSS")
	.dwattr $C$DW$270, DW_AT_const_value(0x07)
	.dwattr $C$DW$270, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/pllc/V0/csl_pllc.h")
	.dwattr $C$DW$270, DW_AT_decl_line(0x67)
	.dwattr $C$DW$270, DW_AT_decl_column(0x05)

$C$DW$271	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$271, DW_AT_name("CSL_PLL_ICSS")
	.dwattr $C$DW$271, DW_AT_const_value(0x08)
	.dwattr $C$DW$271, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/pllc/V0/csl_pllc.h")
	.dwattr $C$DW$271, DW_AT_decl_line(0x68)
	.dwattr $C$DW$271, DW_AT_decl_column(0x05)

$C$DW$272	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$272, DW_AT_name("CSL_PLL_MAX")
	.dwattr $C$DW$272, DW_AT_const_value(0x09)
	.dwattr $C$DW$272, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/pllc/V0/csl_pllc.h")
	.dwattr $C$DW$272, DW_AT_decl_line(0x69)
	.dwattr $C$DW$272, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$262, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/pllc/V0/csl_pllc.h")
	.dwattr $C$DW$T$262, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$T$262, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$262

$C$DW$T$263	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$263, DW_AT_name("CSL_PllcType")
	.dwattr $C$DW$T$263, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$263, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$263, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/pllc/V0/csl_pllc.h")
	.dwattr $C$DW$T$263, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$T$263, DW_AT_decl_column(0x03)


$C$DW$T$264	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$264, DW_AT_byte_size(0x04)
$C$DW$273	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$273, DW_AT_name("CSL_XMC_ACEN_MODE_COUNT_DISABLE")
	.dwattr $C$DW$273, DW_AT_const_value(0x00)
	.dwattr $C$DW$273, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/csl_xmc.h")
	.dwattr $C$DW$273, DW_AT_decl_line(0xbc)
	.dwattr $C$DW$273, DW_AT_decl_column(0x05)

$C$DW$274	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$274, DW_AT_name("CSL_XMC_ACEN_MODE_COUNT_PROGEVENTS")
	.dwattr $C$DW$274, DW_AT_const_value(0x01)
	.dwattr $C$DW$274, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/csl_xmc.h")
	.dwattr $C$DW$274, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$274, DW_AT_decl_column(0x05)

$C$DW$275	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$275, DW_AT_name("CSL_XMC_ACEN_MODE_COUNT_DATAEVENTS")
	.dwattr $C$DW$275, DW_AT_const_value(0x02)
	.dwattr $C$DW$275, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/csl_xmc.h")
	.dwattr $C$DW$275, DW_AT_decl_line(0xc0)
	.dwattr $C$DW$275, DW_AT_decl_column(0x05)

$C$DW$276	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$276, DW_AT_name("CSL_XMC_ACEN_MODE_COUNT_ALL")
	.dwattr $C$DW$276, DW_AT_const_value(0x03)
	.dwattr $C$DW$276, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/csl_xmc.h")
	.dwattr $C$DW$276, DW_AT_decl_line(0xc2)
	.dwattr $C$DW$276, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$264, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/csl_xmc.h")
	.dwattr $C$DW$T$264, DW_AT_decl_line(0xba)
	.dwattr $C$DW$T$264, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$264

$C$DW$T$265	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$265, DW_AT_name("CSL_XMC_ACEN_MODE")
	.dwattr $C$DW$T$265, DW_AT_type(*$C$DW$T$264)
	.dwattr $C$DW$T$265, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$265, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/csl_xmc.h")
	.dwattr $C$DW$T$265, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$T$265, DW_AT_decl_column(0x02)


$C$DW$T$39	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$39, DW_AT_byte_size(0x38)
$C$DW$277	.dwtag  DW_TAG_member
	.dwattr $C$DW$277, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$277, DW_AT_name("manufacturer_id")
	.dwattr $C$DW$277, DW_AT_TI_symbol_name("manufacturer_id")
	.dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$277, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$277, DW_AT_decl_line(0x255)
	.dwattr $C$DW$277, DW_AT_decl_column(0x0d)

$C$DW$278	.dwtag  DW_TAG_member
	.dwattr $C$DW$278, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$278, DW_AT_name("device_id")
	.dwattr $C$DW$278, DW_AT_TI_symbol_name("device_id")
	.dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$278, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$278, DW_AT_decl_line(0x256)
	.dwattr $C$DW$278, DW_AT_decl_column(0x0d)

$C$DW$279	.dwtag  DW_TAG_member
	.dwattr $C$DW$279, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$279, DW_AT_name("type")
	.dwattr $C$DW$279, DW_AT_TI_symbol_name("type")
	.dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$279, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$279, DW_AT_decl_line(0x257)
	.dwattr $C$DW$279, DW_AT_decl_column(0x1b)

$C$DW$280	.dwtag  DW_TAG_member
	.dwattr $C$DW$280, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$280, DW_AT_name("width")
	.dwattr $C$DW$280, DW_AT_TI_symbol_name("width")
	.dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$280, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$280, DW_AT_decl_line(0x258)
	.dwattr $C$DW$280, DW_AT_decl_column(0x0d)

$C$DW$281	.dwtag  DW_TAG_member
	.dwattr $C$DW$281, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$281, DW_AT_name("block_count")
	.dwattr $C$DW$281, DW_AT_TI_symbol_name("block_count")
	.dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$281, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$281, DW_AT_decl_line(0x259)
	.dwattr $C$DW$281, DW_AT_decl_column(0x0d)

$C$DW$282	.dwtag  DW_TAG_member
	.dwattr $C$DW$282, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$282, DW_AT_name("page_count")
	.dwattr $C$DW$282, DW_AT_TI_symbol_name("page_count")
	.dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$282, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$282, DW_AT_decl_line(0x25a)
	.dwattr $C$DW$282, DW_AT_decl_column(0x0d)

$C$DW$283	.dwtag  DW_TAG_member
	.dwattr $C$DW$283, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$283, DW_AT_name("page_size")
	.dwattr $C$DW$283, DW_AT_TI_symbol_name("page_size")
	.dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$283, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$283, DW_AT_decl_line(0x25b)
	.dwattr $C$DW$283, DW_AT_decl_column(0x0d)

$C$DW$284	.dwtag  DW_TAG_member
	.dwattr $C$DW$284, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$284, DW_AT_name("spare_size")
	.dwattr $C$DW$284, DW_AT_TI_symbol_name("spare_size")
	.dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$284, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$284, DW_AT_decl_line(0x25c)
	.dwattr $C$DW$284, DW_AT_decl_column(0x0d)

$C$DW$285	.dwtag  DW_TAG_member
	.dwattr $C$DW$285, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$285, DW_AT_name("handle")
	.dwattr $C$DW$285, DW_AT_TI_symbol_name("handle")
	.dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$285, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$285, DW_AT_decl_line(0x25d)
	.dwattr $C$DW$285, DW_AT_decl_column(0x18)

$C$DW$286	.dwtag  DW_TAG_member
	.dwattr $C$DW$286, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$286, DW_AT_name("bboffset")
	.dwattr $C$DW$286, DW_AT_TI_symbol_name("bboffset")
	.dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$286, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$286, DW_AT_decl_line(0x25e)
	.dwattr $C$DW$286, DW_AT_decl_column(0x0d)

$C$DW$287	.dwtag  DW_TAG_member
	.dwattr $C$DW$287, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$287, DW_AT_name("column")
	.dwattr $C$DW$287, DW_AT_TI_symbol_name("column")
	.dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$287, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$287, DW_AT_decl_line(0x25f)
	.dwattr $C$DW$287, DW_AT_decl_column(0x0b)

$C$DW$288	.dwtag  DW_TAG_member
	.dwattr $C$DW$288, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$288, DW_AT_name("flags")
	.dwattr $C$DW$288, DW_AT_TI_symbol_name("flags")
	.dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$288, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$288, DW_AT_decl_line(0x260)
	.dwattr $C$DW$288, DW_AT_decl_column(0x0b)

$C$DW$289	.dwtag  DW_TAG_member
	.dwattr $C$DW$289, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$289, DW_AT_name("internal")
	.dwattr $C$DW$289, DW_AT_TI_symbol_name("internal")
	.dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$289, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$289, DW_AT_decl_line(0x261)
	.dwattr $C$DW$289, DW_AT_decl_column(0x08)

$C$DW$290	.dwtag  DW_TAG_member
	.dwattr $C$DW$290, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$290, DW_AT_name("bblist")
	.dwattr $C$DW$290, DW_AT_TI_symbol_name("bblist")
	.dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$290, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$290, DW_AT_decl_line(0x262)
	.dwattr $C$DW$290, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$39, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$T$39, DW_AT_decl_line(0x254)
	.dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$39

$C$DW$T$266	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$266, DW_AT_name("PLATFORM_DEVICE_info")
	.dwattr $C$DW$T$266, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$T$266, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$266, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$T$266, DW_AT_decl_line(0x263)
	.dwattr $C$DW$T$266, DW_AT_decl_column(0x03)

$C$DW$T$267	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$267, DW_AT_type(*$C$DW$T$266)
	.dwattr $C$DW$T$267, DW_AT_address_class(0x20)

$C$DW$T$268	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$268, DW_AT_type(*$C$DW$T$267)


$C$DW$T$52	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$52, DW_AT_byte_size(0xa80)
$C$DW$291	.dwtag  DW_TAG_member
	.dwattr $C$DW$291, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$291, DW_AT_name("PID")
	.dwattr $C$DW$291, DW_AT_TI_symbol_name("PID")
	.dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$291, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/psc/V0/cslr_psc.h")
	.dwattr $C$DW$291, DW_AT_decl_line(0x31)
	.dwattr $C$DW$291, DW_AT_decl_column(0x15)

$C$DW$292	.dwtag  DW_TAG_member
	.dwattr $C$DW$292, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$292, DW_AT_name("RSVD0")
	.dwattr $C$DW$292, DW_AT_TI_symbol_name("RSVD0")
	.dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$292, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/psc/V0/cslr_psc.h")
	.dwattr $C$DW$292, DW_AT_decl_line(0x32)
	.dwattr $C$DW$292, DW_AT_decl_column(0x14)

$C$DW$293	.dwtag  DW_TAG_member
	.dwattr $C$DW$293, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$293, DW_AT_name("VCNTLID")
	.dwattr $C$DW$293, DW_AT_TI_symbol_name("VCNTLID")
	.dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$293, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/psc/V0/cslr_psc.h")
	.dwattr $C$DW$293, DW_AT_decl_line(0x33)
	.dwattr $C$DW$293, DW_AT_decl_column(0x15)

$C$DW$294	.dwtag  DW_TAG_member
	.dwattr $C$DW$294, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$294, DW_AT_name("RSVD1")
	.dwattr $C$DW$294, DW_AT_TI_symbol_name("RSVD1")
	.dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$294, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/psc/V0/cslr_psc.h")
	.dwattr $C$DW$294, DW_AT_decl_line(0x34)
	.dwattr $C$DW$294, DW_AT_decl_column(0x14)

$C$DW$295	.dwtag  DW_TAG_member
	.dwattr $C$DW$295, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$295, DW_AT_name("PTCMD")
	.dwattr $C$DW$295, DW_AT_TI_symbol_name("PTCMD")
	.dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
	.dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$295, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/psc/V0/cslr_psc.h")
	.dwattr $C$DW$295, DW_AT_decl_line(0x35)
	.dwattr $C$DW$295, DW_AT_decl_column(0x15)

$C$DW$296	.dwtag  DW_TAG_member
	.dwattr $C$DW$296, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$296, DW_AT_name("RSVD2")
	.dwattr $C$DW$296, DW_AT_TI_symbol_name("RSVD2")
	.dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
	.dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$296, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/psc/V0/cslr_psc.h")
	.dwattr $C$DW$296, DW_AT_decl_line(0x36)
	.dwattr $C$DW$296, DW_AT_decl_column(0x14)

$C$DW$297	.dwtag  DW_TAG_member
	.dwattr $C$DW$297, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$297, DW_AT_name("PTSTAT")
	.dwattr $C$DW$297, DW_AT_TI_symbol_name("PTSTAT")
	.dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
	.dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$297, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/psc/V0/cslr_psc.h")
	.dwattr $C$DW$297, DW_AT_decl_line(0x37)
	.dwattr $C$DW$297, DW_AT_decl_column(0x15)

$C$DW$298	.dwtag  DW_TAG_member
	.dwattr $C$DW$298, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$298, DW_AT_name("RSVD3")
	.dwattr $C$DW$298, DW_AT_TI_symbol_name("RSVD3")
	.dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
	.dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$298, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/psc/V0/cslr_psc.h")
	.dwattr $C$DW$298, DW_AT_decl_line(0x38)
	.dwattr $C$DW$298, DW_AT_decl_column(0x14)

$C$DW$299	.dwtag  DW_TAG_member
	.dwattr $C$DW$299, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$299, DW_AT_name("PDSTAT")
	.dwattr $C$DW$299, DW_AT_TI_symbol_name("PDSTAT")
	.dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
	.dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$299, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/psc/V0/cslr_psc.h")
	.dwattr $C$DW$299, DW_AT_decl_line(0x39)
	.dwattr $C$DW$299, DW_AT_decl_column(0x15)

$C$DW$300	.dwtag  DW_TAG_member
	.dwattr $C$DW$300, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$300, DW_AT_name("RSVD4")
	.dwattr $C$DW$300, DW_AT_TI_symbol_name("RSVD4")
	.dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x280]
	.dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$300, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/psc/V0/cslr_psc.h")
	.dwattr $C$DW$300, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$300, DW_AT_decl_column(0x14)

$C$DW$301	.dwtag  DW_TAG_member
	.dwattr $C$DW$301, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$301, DW_AT_name("PDCTL")
	.dwattr $C$DW$301, DW_AT_TI_symbol_name("PDCTL")
	.dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
	.dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$301, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/psc/V0/cslr_psc.h")
	.dwattr $C$DW$301, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$301, DW_AT_decl_column(0x15)

$C$DW$302	.dwtag  DW_TAG_member
	.dwattr $C$DW$302, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$302, DW_AT_name("RSVD5")
	.dwattr $C$DW$302, DW_AT_TI_symbol_name("RSVD5")
	.dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x380]
	.dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$302, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/psc/V0/cslr_psc.h")
	.dwattr $C$DW$302, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$302, DW_AT_decl_column(0x14)

$C$DW$303	.dwtag  DW_TAG_member
	.dwattr $C$DW$303, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$303, DW_AT_name("MDSTAT")
	.dwattr $C$DW$303, DW_AT_TI_symbol_name("MDSTAT")
	.dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x800]
	.dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$303, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/psc/V0/cslr_psc.h")
	.dwattr $C$DW$303, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$303, DW_AT_decl_column(0x15)

$C$DW$304	.dwtag  DW_TAG_member
	.dwattr $C$DW$304, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$304, DW_AT_name("RSVD6")
	.dwattr $C$DW$304, DW_AT_TI_symbol_name("RSVD6")
	.dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x880]
	.dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$304, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/psc/V0/cslr_psc.h")
	.dwattr $C$DW$304, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$304, DW_AT_decl_column(0x14)

$C$DW$305	.dwtag  DW_TAG_member
	.dwattr $C$DW$305, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$305, DW_AT_name("MDCTL")
	.dwattr $C$DW$305, DW_AT_TI_symbol_name("MDCTL")
	.dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0xa00]
	.dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$305, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/psc/V0/cslr_psc.h")
	.dwattr $C$DW$305, DW_AT_decl_line(0x40)
	.dwattr $C$DW$305, DW_AT_decl_column(0x15)

	.dwattr $C$DW$T$52, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/psc/V0/cslr_psc.h")
	.dwattr $C$DW$T$52, DW_AT_decl_line(0x30)
	.dwattr $C$DW$T$52, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$52

$C$DW$T$271	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$271, DW_AT_name("CSL_PscRegs")
	.dwattr $C$DW$T$271, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$T$271, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$271, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/psc/V0/cslr_psc.h")
	.dwattr $C$DW$T$271, DW_AT_decl_line(0x46)
	.dwattr $C$DW$T$271, DW_AT_decl_column(0x03)

$C$DW$T$272	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$272, DW_AT_type(*$C$DW$T$271)

$C$DW$T$273	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$273, DW_AT_type(*$C$DW$T$272)
	.dwattr $C$DW$T$273, DW_AT_address_class(0x20)

$C$DW$T$274	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$274, DW_AT_name("CSL_PscRegsOvly")
	.dwattr $C$DW$T$274, DW_AT_type(*$C$DW$T$273)
	.dwattr $C$DW$T$274, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$274, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/psc/V0/cslr_psc.h")
	.dwattr $C$DW$T$274, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$T$274, DW_AT_decl_column(0x2b)


$C$DW$T$56	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$56, DW_AT_byte_size(0xe0)
$C$DW$306	.dwtag  DW_TAG_member
	.dwattr $C$DW$306, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$306, DW_AT_name("RCSR")
	.dwattr $C$DW$306, DW_AT_TI_symbol_name("RCSR")
	.dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$306, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$306, DW_AT_decl_line(0x38)
	.dwattr $C$DW$306, DW_AT_decl_column(0x15)

$C$DW$307	.dwtag  DW_TAG_member
	.dwattr $C$DW$307, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$307, DW_AT_name("AWCCR")
	.dwattr $C$DW$307, DW_AT_TI_symbol_name("AWCCR")
	.dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$307, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$307, DW_AT_decl_line(0x39)
	.dwattr $C$DW$307, DW_AT_decl_column(0x15)

$C$DW$308	.dwtag  DW_TAG_member
	.dwattr $C$DW$308, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$308, DW_AT_name("RSVD0")
	.dwattr $C$DW$308, DW_AT_TI_symbol_name("RSVD0")
	.dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$308, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$308, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$308, DW_AT_decl_column(0x14)

$C$DW$309	.dwtag  DW_TAG_member
	.dwattr $C$DW$309, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$309, DW_AT_name("A0CR")
	.dwattr $C$DW$309, DW_AT_TI_symbol_name("A0CR")
	.dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$309, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$309, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$309, DW_AT_decl_column(0x15)

$C$DW$310	.dwtag  DW_TAG_member
	.dwattr $C$DW$310, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$310, DW_AT_name("A1CR")
	.dwattr $C$DW$310, DW_AT_TI_symbol_name("A1CR")
	.dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$310, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$310, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$310, DW_AT_decl_column(0x15)

$C$DW$311	.dwtag  DW_TAG_member
	.dwattr $C$DW$311, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$311, DW_AT_name("A2CR")
	.dwattr $C$DW$311, DW_AT_TI_symbol_name("A2CR")
	.dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$311, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$311, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$311, DW_AT_decl_column(0x15)

$C$DW$312	.dwtag  DW_TAG_member
	.dwattr $C$DW$312, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$312, DW_AT_name("A3CR")
	.dwattr $C$DW$312, DW_AT_TI_symbol_name("A3CR")
	.dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$312, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$312, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$312, DW_AT_decl_column(0x15)

$C$DW$313	.dwtag  DW_TAG_member
	.dwattr $C$DW$313, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$313, DW_AT_name("RSVD1")
	.dwattr $C$DW$313, DW_AT_TI_symbol_name("RSVD1")
	.dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$313, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$313, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$313, DW_AT_decl_column(0x14)

$C$DW$314	.dwtag  DW_TAG_member
	.dwattr $C$DW$314, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$314, DW_AT_name("IRR")
	.dwattr $C$DW$314, DW_AT_TI_symbol_name("IRR")
	.dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$314, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$314, DW_AT_decl_line(0x40)
	.dwattr $C$DW$314, DW_AT_decl_column(0x15)

$C$DW$315	.dwtag  DW_TAG_member
	.dwattr $C$DW$315, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$315, DW_AT_name("IMR")
	.dwattr $C$DW$315, DW_AT_TI_symbol_name("IMR")
	.dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$315, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$315, DW_AT_decl_line(0x41)
	.dwattr $C$DW$315, DW_AT_decl_column(0x15)

$C$DW$316	.dwtag  DW_TAG_member
	.dwattr $C$DW$316, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$316, DW_AT_name("IMSR")
	.dwattr $C$DW$316, DW_AT_TI_symbol_name("IMSR")
	.dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$316, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$316, DW_AT_decl_line(0x42)
	.dwattr $C$DW$316, DW_AT_decl_column(0x15)

$C$DW$317	.dwtag  DW_TAG_member
	.dwattr $C$DW$317, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$317, DW_AT_name("IMCR")
	.dwattr $C$DW$317, DW_AT_TI_symbol_name("IMCR")
	.dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$317, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$317, DW_AT_decl_line(0x43)
	.dwattr $C$DW$317, DW_AT_decl_column(0x15)

$C$DW$318	.dwtag  DW_TAG_member
	.dwattr $C$DW$318, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$318, DW_AT_name("IOCR")
	.dwattr $C$DW$318, DW_AT_TI_symbol_name("IOCR")
	.dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$318, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$318, DW_AT_decl_line(0x44)
	.dwattr $C$DW$318, DW_AT_decl_column(0x15)

$C$DW$319	.dwtag  DW_TAG_member
	.dwattr $C$DW$319, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$319, DW_AT_name("IOSR")
	.dwattr $C$DW$319, DW_AT_TI_symbol_name("IOSR")
	.dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$319, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$319, DW_AT_decl_line(0x45)
	.dwattr $C$DW$319, DW_AT_decl_column(0x15)

$C$DW$320	.dwtag  DW_TAG_member
	.dwattr $C$DW$320, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$320, DW_AT_name("RSVD2")
	.dwattr $C$DW$320, DW_AT_TI_symbol_name("RSVD2")
	.dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$320, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$320, DW_AT_decl_line(0x46)
	.dwattr $C$DW$320, DW_AT_decl_column(0x14)

$C$DW$321	.dwtag  DW_TAG_member
	.dwattr $C$DW$321, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$321, DW_AT_name("NANDFCTL")
	.dwattr $C$DW$321, DW_AT_TI_symbol_name("NANDFCTL")
	.dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$321, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$321, DW_AT_decl_line(0x47)
	.dwattr $C$DW$321, DW_AT_decl_column(0x15)

$C$DW$322	.dwtag  DW_TAG_member
	.dwattr $C$DW$322, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$322, DW_AT_name("NANDFSR")
	.dwattr $C$DW$322, DW_AT_TI_symbol_name("NANDFSR")
	.dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$322, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$322, DW_AT_decl_line(0x48)
	.dwattr $C$DW$322, DW_AT_decl_column(0x15)

$C$DW$323	.dwtag  DW_TAG_member
	.dwattr $C$DW$323, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$323, DW_AT_name("PMCR")
	.dwattr $C$DW$323, DW_AT_TI_symbol_name("PMCR")
	.dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$323, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$323, DW_AT_decl_line(0x49)
	.dwattr $C$DW$323, DW_AT_decl_column(0x15)

$C$DW$324	.dwtag  DW_TAG_member
	.dwattr $C$DW$324, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$324, DW_AT_name("RSVD3")
	.dwattr $C$DW$324, DW_AT_TI_symbol_name("RSVD3")
	.dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$324, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$324, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$324, DW_AT_decl_column(0x14)

$C$DW$325	.dwtag  DW_TAG_member
	.dwattr $C$DW$325, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$325, DW_AT_name("NFECCCE0")
	.dwattr $C$DW$325, DW_AT_TI_symbol_name("NFECCCE0")
	.dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$325, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$325, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$325, DW_AT_decl_column(0x15)

$C$DW$326	.dwtag  DW_TAG_member
	.dwattr $C$DW$326, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$326, DW_AT_name("NFECCCE1")
	.dwattr $C$DW$326, DW_AT_TI_symbol_name("NFECCCE1")
	.dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$326, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$326, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$326, DW_AT_decl_column(0x15)

$C$DW$327	.dwtag  DW_TAG_member
	.dwattr $C$DW$327, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$327, DW_AT_name("NFECCCE2")
	.dwattr $C$DW$327, DW_AT_TI_symbol_name("NFECCCE2")
	.dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
	.dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$327, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$327, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$327, DW_AT_decl_column(0x15)

$C$DW$328	.dwtag  DW_TAG_member
	.dwattr $C$DW$328, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$328, DW_AT_name("NFECCCE3")
	.dwattr $C$DW$328, DW_AT_TI_symbol_name("NFECCCE3")
	.dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$328, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$328, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$328, DW_AT_decl_column(0x15)

$C$DW$329	.dwtag  DW_TAG_member
	.dwattr $C$DW$329, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$329, DW_AT_name("RSVD4")
	.dwattr $C$DW$329, DW_AT_TI_symbol_name("RSVD4")
	.dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$329, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$329, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$329, DW_AT_decl_column(0x14)

$C$DW$330	.dwtag  DW_TAG_member
	.dwattr $C$DW$330, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$330, DW_AT_name("IODFTEXECNT")
	.dwattr $C$DW$330, DW_AT_TI_symbol_name("IODFTEXECNT")
	.dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
	.dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$330, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$330, DW_AT_decl_line(0x50)
	.dwattr $C$DW$330, DW_AT_decl_column(0x15)

$C$DW$331	.dwtag  DW_TAG_member
	.dwattr $C$DW$331, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$331, DW_AT_name("IODFTGBLCTRL")
	.dwattr $C$DW$331, DW_AT_TI_symbol_name("IODFTGBLCTRL")
	.dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$331, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$331, DW_AT_decl_line(0x51)
	.dwattr $C$DW$331, DW_AT_decl_column(0x15)

$C$DW$332	.dwtag  DW_TAG_member
	.dwattr $C$DW$332, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$332, DW_AT_name("RSVD5")
	.dwattr $C$DW$332, DW_AT_TI_symbol_name("RSVD5")
	.dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
	.dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$332, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$332, DW_AT_decl_line(0x52)
	.dwattr $C$DW$332, DW_AT_decl_column(0x14)

$C$DW$333	.dwtag  DW_TAG_member
	.dwattr $C$DW$333, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$333, DW_AT_name("IODFTTLAMISR")
	.dwattr $C$DW$333, DW_AT_TI_symbol_name("IODFTTLAMISR")
	.dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
	.dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$333, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$333, DW_AT_decl_line(0x53)
	.dwattr $C$DW$333, DW_AT_decl_column(0x15)

$C$DW$334	.dwtag  DW_TAG_member
	.dwattr $C$DW$334, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$334, DW_AT_name("IODFTTLDMISR")
	.dwattr $C$DW$334, DW_AT_TI_symbol_name("IODFTTLDMISR")
	.dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
	.dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$334, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$334, DW_AT_decl_line(0x54)
	.dwattr $C$DW$334, DW_AT_decl_column(0x15)

$C$DW$335	.dwtag  DW_TAG_member
	.dwattr $C$DW$335, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$335, DW_AT_name("IODFTTLDCMISR")
	.dwattr $C$DW$335, DW_AT_TI_symbol_name("IODFTTLDCMISR")
	.dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
	.dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$335, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$335, DW_AT_decl_line(0x55)
	.dwattr $C$DW$335, DW_AT_decl_column(0x15)

$C$DW$336	.dwtag  DW_TAG_member
	.dwattr $C$DW$336, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$336, DW_AT_name("RSVD6")
	.dwattr $C$DW$336, DW_AT_TI_symbol_name("RSVD6")
	.dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
	.dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$336, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$336, DW_AT_decl_line(0x56)
	.dwattr $C$DW$336, DW_AT_decl_column(0x14)

$C$DW$337	.dwtag  DW_TAG_member
	.dwattr $C$DW$337, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$337, DW_AT_name("MODRELNUM")
	.dwattr $C$DW$337, DW_AT_TI_symbol_name("MODRELNUM")
	.dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
	.dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$337, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$337, DW_AT_decl_line(0x57)
	.dwattr $C$DW$337, DW_AT_decl_column(0x15)

$C$DW$338	.dwtag  DW_TAG_member
	.dwattr $C$DW$338, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$338, DW_AT_name("RSVD7")
	.dwattr $C$DW$338, DW_AT_TI_symbol_name("RSVD7")
	.dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
	.dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$338, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$338, DW_AT_decl_line(0x58)
	.dwattr $C$DW$338, DW_AT_decl_column(0x14)

$C$DW$339	.dwtag  DW_TAG_member
	.dwattr $C$DW$339, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$339, DW_AT_name("NANDF4BECCLR")
	.dwattr $C$DW$339, DW_AT_TI_symbol_name("NANDF4BECCLR")
	.dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
	.dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$339, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$339, DW_AT_decl_line(0x59)
	.dwattr $C$DW$339, DW_AT_decl_column(0x15)

$C$DW$340	.dwtag  DW_TAG_member
	.dwattr $C$DW$340, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$340, DW_AT_name("NANDF4BECC1R")
	.dwattr $C$DW$340, DW_AT_TI_symbol_name("NANDF4BECC1R")
	.dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
	.dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$340, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$340, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$340, DW_AT_decl_column(0x15)

$C$DW$341	.dwtag  DW_TAG_member
	.dwattr $C$DW$341, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$341, DW_AT_name("NANDF4BECC2R")
	.dwattr $C$DW$341, DW_AT_TI_symbol_name("NANDF4BECC2R")
	.dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
	.dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$341, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$341, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$341, DW_AT_decl_column(0x15)

$C$DW$342	.dwtag  DW_TAG_member
	.dwattr $C$DW$342, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$342, DW_AT_name("NANDF4BECC3R")
	.dwattr $C$DW$342, DW_AT_TI_symbol_name("NANDF4BECC3R")
	.dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
	.dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$342, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$342, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$342, DW_AT_decl_column(0x15)

$C$DW$343	.dwtag  DW_TAG_member
	.dwattr $C$DW$343, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$343, DW_AT_name("NANDF4BECC4R")
	.dwattr $C$DW$343, DW_AT_TI_symbol_name("NANDF4BECC4R")
	.dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
	.dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$343, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$343, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$343, DW_AT_decl_column(0x15)

$C$DW$344	.dwtag  DW_TAG_member
	.dwattr $C$DW$344, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$344, DW_AT_name("NANDFEA1R")
	.dwattr $C$DW$344, DW_AT_TI_symbol_name("NANDFEA1R")
	.dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
	.dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$344, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$344, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$344, DW_AT_decl_column(0x15)

$C$DW$345	.dwtag  DW_TAG_member
	.dwattr $C$DW$345, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$345, DW_AT_name("NANDFEA2R")
	.dwattr $C$DW$345, DW_AT_TI_symbol_name("NANDFEA2R")
	.dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
	.dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$345, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$345, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$345, DW_AT_decl_column(0x15)

$C$DW$346	.dwtag  DW_TAG_member
	.dwattr $C$DW$346, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$346, DW_AT_name("NANDFEV1R")
	.dwattr $C$DW$346, DW_AT_TI_symbol_name("NANDFEV1R")
	.dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
	.dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$346, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$346, DW_AT_decl_line(0x60)
	.dwattr $C$DW$346, DW_AT_decl_column(0x15)

$C$DW$347	.dwtag  DW_TAG_member
	.dwattr $C$DW$347, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$347, DW_AT_name("NANDFEV2R")
	.dwattr $C$DW$347, DW_AT_TI_symbol_name("NANDFEV2R")
	.dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
	.dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$347, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$347, DW_AT_decl_line(0x61)
	.dwattr $C$DW$347, DW_AT_decl_column(0x15)

	.dwattr $C$DW$T$56, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$T$56, DW_AT_decl_line(0x37)
	.dwattr $C$DW$T$56, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$56

$C$DW$T$276	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$276, DW_AT_name("CSL_Emif16Regs")
	.dwattr $C$DW$T$276, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$276, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$276, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/ti/csl/./cslr_emif16.h")
	.dwattr $C$DW$T$276, DW_AT_decl_line(0x62)
	.dwattr $C$DW$T$276, DW_AT_decl_column(0x03)


$C$DW$T$57	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$57, DW_AT_byte_size(0x10)
$C$DW$348	.dwtag  DW_TAG_member
	.dwattr $C$DW$348, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$348, DW_AT_name("__max_align1")
	.dwattr $C$DW$348, DW_AT_TI_symbol_name("__max_align1")
	.dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$348, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot-native/usr/share/ti/cgt-c6x/include/sys/_types.h")
	.dwattr $C$DW$348, DW_AT_decl_line(0x70)
	.dwattr $C$DW$348, DW_AT_decl_column(0x0c)

$C$DW$349	.dwtag  DW_TAG_member
	.dwattr $C$DW$349, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$349, DW_AT_name("__max_align2")
	.dwattr $C$DW$349, DW_AT_TI_symbol_name("__max_align2")
	.dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$349, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot-native/usr/share/ti/cgt-c6x/include/sys/_types.h")
	.dwattr $C$DW$349, DW_AT_decl_line(0x71)
	.dwattr $C$DW$349, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$57, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot-native/usr/share/ti/cgt-c6x/include/sys/_types.h")
	.dwattr $C$DW$T$57, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$T$57, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$57

$C$DW$T$278	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$278, DW_AT_name("__max_align_t")
	.dwattr $C$DW$T$278, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$T$278, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$278, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot-native/usr/share/ti/cgt-c6x/include/sys/_types.h")
	.dwattr $C$DW$T$278, DW_AT_decl_line(0x72)
	.dwattr $C$DW$T$278, DW_AT_decl_column(0x03)


$C$DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$62, DW_AT_byte_size(0x34)
$C$DW$350	.dwtag  DW_TAG_member
	.dwattr $C$DW$350, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$350, DW_AT_name("core_count")
	.dwattr $C$DW$350, DW_AT_TI_symbol_name("core_count")
	.dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$350, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$350, DW_AT_decl_line(0x98)
	.dwattr $C$DW$350, DW_AT_decl_column(0x0d)

$C$DW$351	.dwtag  DW_TAG_member
	.dwattr $C$DW$351, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$351, DW_AT_name("name")
	.dwattr $C$DW$351, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$351, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$351, DW_AT_decl_line(0x9a)
	.dwattr $C$DW$351, DW_AT_decl_column(0x0a)

$C$DW$352	.dwtag  DW_TAG_member
	.dwattr $C$DW$352, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$352, DW_AT_name("id")
	.dwattr $C$DW$352, DW_AT_TI_symbol_name("id")
	.dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$352, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$352, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$352, DW_AT_decl_column(0x0e)

$C$DW$353	.dwtag  DW_TAG_member
	.dwattr $C$DW$353, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$353, DW_AT_name("revision_id")
	.dwattr $C$DW$353, DW_AT_TI_symbol_name("revision_id")
	.dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$353, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$353, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$353, DW_AT_decl_column(0x0e)

$C$DW$354	.dwtag  DW_TAG_member
	.dwattr $C$DW$354, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$354, DW_AT_name("megamodule_revision_major")
	.dwattr $C$DW$354, DW_AT_TI_symbol_name("megamodule_revision_major")
	.dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$354, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$354, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$354, DW_AT_decl_column(0x0e)

$C$DW$355	.dwtag  DW_TAG_member
	.dwattr $C$DW$355, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$355, DW_AT_name("megamodule_revision_minor")
	.dwattr $C$DW$355, DW_AT_TI_symbol_name("megamodule_revision_minor")
	.dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$355, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$355, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$355, DW_AT_decl_column(0x0e)

$C$DW$356	.dwtag  DW_TAG_member
	.dwattr $C$DW$356, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$356, DW_AT_name("silicon_revision_major")
	.dwattr $C$DW$356, DW_AT_TI_symbol_name("silicon_revision_major")
	.dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$356, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$356, DW_AT_decl_line(0xa4)
	.dwattr $C$DW$356, DW_AT_decl_column(0x0e)

$C$DW$357	.dwtag  DW_TAG_member
	.dwattr $C$DW$357, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$357, DW_AT_name("silicon_revision_minor")
	.dwattr $C$DW$357, DW_AT_TI_symbol_name("silicon_revision_minor")
	.dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$357, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$357, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$357, DW_AT_decl_column(0x0e)

$C$DW$358	.dwtag  DW_TAG_member
	.dwattr $C$DW$358, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$358, DW_AT_name("endian")
	.dwattr $C$DW$358, DW_AT_TI_symbol_name("endian")
	.dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$358, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$358, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$358, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$62, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$T$62, DW_AT_decl_line(0x97)
	.dwattr $C$DW$T$62, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$62

$C$DW$T$70	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$70, DW_AT_name("CPU_info")
	.dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$70, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$T$70, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$T$70, DW_AT_decl_column(0x03)


$C$DW$T$64	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$64, DW_AT_byte_size(0x10)
$C$DW$359	.dwtag  DW_TAG_member
	.dwattr $C$DW$359, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$359, DW_AT_name("port_count")
	.dwattr $C$DW$359, DW_AT_TI_symbol_name("port_count")
	.dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$359, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$359, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$359, DW_AT_decl_column(0x0d)

$C$DW$360	.dwtag  DW_TAG_member
	.dwattr $C$DW$360, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$360, DW_AT_name("efuse_mac_address")
	.dwattr $C$DW$360, DW_AT_TI_symbol_name("efuse_mac_address")
	.dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$360, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$360, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$360, DW_AT_decl_column(0x0d)

$C$DW$361	.dwtag  DW_TAG_member
	.dwattr $C$DW$361, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$361, DW_AT_name("eeprom_mac_address")
	.dwattr $C$DW$361, DW_AT_TI_symbol_name("eeprom_mac_address")
	.dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$361, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$361, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$361, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$64, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$T$64, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$T$64, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$64

$C$DW$T$71	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$71, DW_AT_name("EMAC_info")
	.dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$71, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$T$71, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$T$71, DW_AT_decl_column(0x03)


$C$DW$T$67	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$67, DW_AT_byte_size(0x10)
$C$DW$362	.dwtag  DW_TAG_member
	.dwattr $C$DW$362, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$362, DW_AT_name("port_num")
	.dwattr $C$DW$362, DW_AT_TI_symbol_name("port_num")
	.dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$362, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$362, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$362, DW_AT_decl_column(0x25)

$C$DW$363	.dwtag  DW_TAG_member
	.dwattr $C$DW$363, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$363, DW_AT_name("mode")
	.dwattr $C$DW$363, DW_AT_TI_symbol_name("mode")
	.dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$363, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$363, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$363, DW_AT_decl_column(0x25)

$C$DW$364	.dwtag  DW_TAG_member
	.dwattr $C$DW$364, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$364, DW_AT_name("mac_address")
	.dwattr $C$DW$364, DW_AT_TI_symbol_name("mac_address")
	.dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$364, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$364, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$364, DW_AT_decl_column(0x25)

	.dwattr $C$DW$T$67, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$T$67, DW_AT_decl_line(0xcc)
	.dwattr $C$DW$T$67, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$67

$C$DW$T$279	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$279, DW_AT_name("PLATFORM_EMAC_EXT_info")
	.dwattr $C$DW$T$279, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$T$279, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$279, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$T$279, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$279, DW_AT_decl_column(0x03)


$C$DW$T$68	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$68, DW_AT_byte_size(0x04)
$C$DW$365	.dwtag  DW_TAG_member
	.dwattr $C$DW$365, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$365, DW_AT_name("count")
	.dwattr $C$DW$365, DW_AT_TI_symbol_name("count")
	.dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$365, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$365, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$365, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$68, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$T$68, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$T$68, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$68

$C$DW$T$72	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$72, DW_AT_name("LED_info")
	.dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$72, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$T$72, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$T$72, DW_AT_decl_column(0x03)


$C$DW$T$73	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$73, DW_AT_byte_size(0x08)
$C$DW$366	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$366, DW_AT_upper_bound(0x01)

	.dwendtag $C$DW$T$73


$C$DW$T$74	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$74, DW_AT_byte_size(0x94)
$C$DW$367	.dwtag  DW_TAG_member
	.dwattr $C$DW$367, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$367, DW_AT_name("version")
	.dwattr $C$DW$367, DW_AT_TI_symbol_name("version")
	.dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$367, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$367, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$367, DW_AT_decl_column(0x0a)

$C$DW$368	.dwtag  DW_TAG_member
	.dwattr $C$DW$368, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$368, DW_AT_name("cpu")
	.dwattr $C$DW$368, DW_AT_TI_symbol_name("cpu")
	.dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$368, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$368, DW_AT_decl_line(0xfd)
	.dwattr $C$DW$368, DW_AT_decl_column(0x0e)

$C$DW$369	.dwtag  DW_TAG_member
	.dwattr $C$DW$369, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$369, DW_AT_name("board_name")
	.dwattr $C$DW$369, DW_AT_TI_symbol_name("board_name")
	.dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$369, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$369, DW_AT_decl_line(0xff)
	.dwattr $C$DW$369, DW_AT_decl_column(0x0a)

$C$DW$370	.dwtag  DW_TAG_member
	.dwattr $C$DW$370, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$370, DW_AT_name("serial_nbr")
	.dwattr $C$DW$370, DW_AT_TI_symbol_name("serial_nbr")
	.dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$370, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$370, DW_AT_decl_line(0x101)
	.dwattr $C$DW$370, DW_AT_decl_column(0x0a)

$C$DW$371	.dwtag  DW_TAG_member
	.dwattr $C$DW$371, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$371, DW_AT_name("board_rev")
	.dwattr $C$DW$371, DW_AT_TI_symbol_name("board_rev")
	.dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$371, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$371, DW_AT_decl_line(0x103)
	.dwattr $C$DW$371, DW_AT_decl_column(0x0e)

$C$DW$372	.dwtag  DW_TAG_member
	.dwattr $C$DW$372, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$372, DW_AT_name("frequency")
	.dwattr $C$DW$372, DW_AT_TI_symbol_name("frequency")
	.dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
	.dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$372, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$372, DW_AT_decl_line(0x105)
	.dwattr $C$DW$372, DW_AT_decl_column(0x0b)

$C$DW$373	.dwtag  DW_TAG_member
	.dwattr $C$DW$373, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$373, DW_AT_name("emac")
	.dwattr $C$DW$373, DW_AT_TI_symbol_name("emac")
	.dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$373, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$373, DW_AT_decl_line(0x108)
	.dwattr $C$DW$373, DW_AT_decl_column(0x0f)

$C$DW$374	.dwtag  DW_TAG_member
	.dwattr $C$DW$374, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$374, DW_AT_name("led")
	.dwattr $C$DW$374, DW_AT_TI_symbol_name("led")
	.dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
	.dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$374, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$374, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$374, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$74, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$T$74, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$T$74, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$74

$C$DW$T$280	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$280, DW_AT_name("platform_info")
	.dwattr $C$DW$T$280, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$T$280, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$280, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$T$280, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$T$280, DW_AT_decl_column(0x03)


$C$DW$T$75	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$75, DW_AT_byte_size(0x05)
$C$DW$375	.dwtag  DW_TAG_member
	.dwattr $C$DW$375, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$375, DW_AT_name("pll")
	.dwattr $C$DW$375, DW_AT_TI_symbol_name("pll")
	.dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$375, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$375, DW_AT_decl_line(0x122)
	.dwattr $C$DW$375, DW_AT_decl_column(0x0d)

$C$DW$376	.dwtag  DW_TAG_member
	.dwattr $C$DW$376, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$376, DW_AT_name("ddr")
	.dwattr $C$DW$376, DW_AT_TI_symbol_name("ddr")
	.dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$376, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$376, DW_AT_decl_line(0x124)
	.dwattr $C$DW$376, DW_AT_decl_column(0x0d)

$C$DW$377	.dwtag  DW_TAG_member
	.dwattr $C$DW$377, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$377, DW_AT_name("tcsl")
	.dwattr $C$DW$377, DW_AT_TI_symbol_name("tcsl")
	.dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$377, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$377, DW_AT_decl_line(0x126)
	.dwattr $C$DW$377, DW_AT_decl_column(0x0d)

$C$DW$378	.dwtag  DW_TAG_member
	.dwattr $C$DW$378, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$378, DW_AT_name("phy")
	.dwattr $C$DW$378, DW_AT_TI_symbol_name("phy")
	.dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$378, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$378, DW_AT_decl_line(0x128)
	.dwattr $C$DW$378, DW_AT_decl_column(0x0d)

$C$DW$379	.dwtag  DW_TAG_member
	.dwattr $C$DW$379, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$379, DW_AT_name("ecc")
	.dwattr $C$DW$379, DW_AT_TI_symbol_name("ecc")
	.dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$379, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$379, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$379, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$75, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$T$75, DW_AT_decl_line(0x121)
	.dwattr $C$DW$T$75, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$75

$C$DW$T$281	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$281, DW_AT_name("platform_init_flags")
	.dwattr $C$DW$T$281, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$T$281, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$281, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$T$281, DW_AT_decl_line(0x12c)
	.dwattr $C$DW$T$281, DW_AT_decl_column(0x03)


$C$DW$T$76	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$76, DW_AT_byte_size(0x14)
$C$DW$380	.dwtag  DW_TAG_member
	.dwattr $C$DW$380, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$380, DW_AT_name("pllm")
	.dwattr $C$DW$380, DW_AT_TI_symbol_name("pllm")
	.dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$380, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$380, DW_AT_decl_line(0x134)
	.dwattr $C$DW$380, DW_AT_decl_column(0x0e)

$C$DW$381	.dwtag  DW_TAG_member
	.dwattr $C$DW$381, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$381, DW_AT_name("plld")
	.dwattr $C$DW$381, DW_AT_TI_symbol_name("plld")
	.dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$381, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$381, DW_AT_decl_line(0x136)
	.dwattr $C$DW$381, DW_AT_decl_column(0x0e)

$C$DW$382	.dwtag  DW_TAG_member
	.dwattr $C$DW$382, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$382, DW_AT_name("prediv")
	.dwattr $C$DW$382, DW_AT_TI_symbol_name("prediv")
	.dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$382, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$382, DW_AT_decl_line(0x138)
	.dwattr $C$DW$382, DW_AT_decl_column(0x0e)

$C$DW$383	.dwtag  DW_TAG_member
	.dwattr $C$DW$383, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$383, DW_AT_name("postdiv")
	.dwattr $C$DW$383, DW_AT_TI_symbol_name("postdiv")
	.dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$383, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$383, DW_AT_decl_line(0x13a)
	.dwattr $C$DW$383, DW_AT_decl_column(0x0e)

$C$DW$384	.dwtag  DW_TAG_member
	.dwattr $C$DW$384, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$384, DW_AT_name("mastercore")
	.dwattr $C$DW$384, DW_AT_TI_symbol_name("mastercore")
	.dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$384, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$384, DW_AT_decl_line(0x13c)
	.dwattr $C$DW$384, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$76, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$T$76, DW_AT_decl_line(0x133)
	.dwattr $C$DW$T$76, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$76

$C$DW$T$282	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$282, DW_AT_name("platform_init_config")
	.dwattr $C$DW$T$282, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$T$282, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$282, DW_AT_decl_file("../../platform.h")
	.dwattr $C$DW$T$282, DW_AT_decl_line(0x13e)
	.dwattr $C$DW$T$282, DW_AT_decl_column(0x04)


$C$DW$T$77	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$77, DW_AT_byte_size(0x08)
$C$DW$385	.dwtag  DW_TAG_member
	.dwattr $C$DW$385, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$385, DW_AT_name("quot")
	.dwattr $C$DW$385, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$385, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot-native/usr/share/ti/cgt-c6x/include/stdlib.h")
	.dwattr $C$DW$385, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$385, DW_AT_decl_column(0x16)

$C$DW$386	.dwtag  DW_TAG_member
	.dwattr $C$DW$386, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$386, DW_AT_name("rem")
	.dwattr $C$DW$386, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$386, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot-native/usr/share/ti/cgt-c6x/include/stdlib.h")
	.dwattr $C$DW$386, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$386, DW_AT_decl_column(0x1c)

	.dwattr $C$DW$T$77, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot-native/usr/share/ti/cgt-c6x/include/stdlib.h")
	.dwattr $C$DW$T$77, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$T$77, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$77

$C$DW$T$283	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$283, DW_AT_name("div_t")
	.dwattr $C$DW$T$283, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$T$283, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$283, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot-native/usr/share/ti/cgt-c6x/include/stdlib.h")
	.dwattr $C$DW$T$283, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$T$283, DW_AT_decl_column(0x23)


$C$DW$T$78	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$78, DW_AT_byte_size(0x08)
$C$DW$387	.dwtag  DW_TAG_member
	.dwattr $C$DW$387, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$387, DW_AT_name("quot")
	.dwattr $C$DW$387, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$387, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot-native/usr/share/ti/cgt-c6x/include/stdlib.h")
	.dwattr $C$DW$387, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$387, DW_AT_decl_column(0x17)

$C$DW$388	.dwtag  DW_TAG_member
	.dwattr $C$DW$388, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$388, DW_AT_name("rem")
	.dwattr $C$DW$388, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$388, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot-native/usr/share/ti/cgt-c6x/include/stdlib.h")
	.dwattr $C$DW$388, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$388, DW_AT_decl_column(0x1d)

	.dwattr $C$DW$T$78, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot-native/usr/share/ti/cgt-c6x/include/stdlib.h")
	.dwattr $C$DW$T$78, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$T$78, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$78

$C$DW$T$284	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$284, DW_AT_name("ldiv_t")
	.dwattr $C$DW$T$284, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$T$284, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$284, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot-native/usr/share/ti/cgt-c6x/include/stdlib.h")
	.dwattr $C$DW$T$284, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$T$284, DW_AT_decl_column(0x24)


$C$DW$T$79	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$79, DW_AT_byte_size(0x10)
$C$DW$389	.dwtag  DW_TAG_member
	.dwattr $C$DW$389, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$389, DW_AT_name("quot")
	.dwattr $C$DW$389, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$389, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot-native/usr/share/ti/cgt-c6x/include/stdlib.h")
	.dwattr $C$DW$389, DW_AT_decl_line(0x58)
	.dwattr $C$DW$389, DW_AT_decl_column(0x1c)

$C$DW$390	.dwtag  DW_TAG_member
	.dwattr $C$DW$390, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$390, DW_AT_name("rem")
	.dwattr $C$DW$390, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$390, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot-native/usr/share/ti/cgt-c6x/include/stdlib.h")
	.dwattr $C$DW$390, DW_AT_decl_line(0x58)
	.dwattr $C$DW$390, DW_AT_decl_column(0x22)

	.dwattr $C$DW$T$79, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot-native/usr/share/ti/cgt-c6x/include/stdlib.h")
	.dwattr $C$DW$T$79, DW_AT_decl_line(0x58)
	.dwattr $C$DW$T$79, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$79

$C$DW$T$285	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$285, DW_AT_name("lldiv_t")
	.dwattr $C$DW$T$285, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$T$285, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$285, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot-native/usr/share/ti/cgt-c6x/include/stdlib.h")
	.dwattr $C$DW$T$285, DW_AT_decl_line(0x58)
	.dwattr $C$DW$T$285, DW_AT_decl_column(0x29)


$C$DW$T$83	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$83, DW_AT_byte_size(0x50c)
$C$DW$391	.dwtag  DW_TAG_member
	.dwattr $C$DW$391, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$391, DW_AT_name("SEM_PID")
	.dwattr $C$DW$391, DW_AT_TI_symbol_name("SEM_PID")
	.dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$391, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/cslr_sem.h")
	.dwattr $C$DW$391, DW_AT_decl_line(0x30)
	.dwattr $C$DW$391, DW_AT_decl_column(0x15)

$C$DW$392	.dwtag  DW_TAG_member
	.dwattr $C$DW$392, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$392, DW_AT_name("SEM_SCRATCH")
	.dwattr $C$DW$392, DW_AT_TI_symbol_name("SEM_SCRATCH")
	.dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$392, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/cslr_sem.h")
	.dwattr $C$DW$392, DW_AT_decl_line(0x31)
	.dwattr $C$DW$392, DW_AT_decl_column(0x15)

$C$DW$393	.dwtag  DW_TAG_member
	.dwattr $C$DW$393, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$393, DW_AT_name("SEM_RST_RUN")
	.dwattr $C$DW$393, DW_AT_TI_symbol_name("SEM_RST_RUN")
	.dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$393, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/cslr_sem.h")
	.dwattr $C$DW$393, DW_AT_decl_line(0x32)
	.dwattr $C$DW$393, DW_AT_decl_column(0x15)

$C$DW$394	.dwtag  DW_TAG_member
	.dwattr $C$DW$394, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$394, DW_AT_name("SEM_EOI")
	.dwattr $C$DW$394, DW_AT_TI_symbol_name("SEM_EOI")
	.dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$394, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/cslr_sem.h")
	.dwattr $C$DW$394, DW_AT_decl_line(0x33)
	.dwattr $C$DW$394, DW_AT_decl_column(0x15)

$C$DW$395	.dwtag  DW_TAG_member
	.dwattr $C$DW$395, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$395, DW_AT_name("RSVD0")
	.dwattr $C$DW$395, DW_AT_TI_symbol_name("RSVD0")
	.dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$395, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/cslr_sem.h")
	.dwattr $C$DW$395, DW_AT_decl_line(0x34)
	.dwattr $C$DW$395, DW_AT_decl_column(0x15)

$C$DW$396	.dwtag  DW_TAG_member
	.dwattr $C$DW$396, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$396, DW_AT_name("SEM")
	.dwattr $C$DW$396, DW_AT_TI_symbol_name("SEM")
	.dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
	.dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$396, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/cslr_sem.h")
	.dwattr $C$DW$396, DW_AT_decl_line(0x35)
	.dwattr $C$DW$396, DW_AT_decl_column(0x15)

$C$DW$397	.dwtag  DW_TAG_member
	.dwattr $C$DW$397, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$397, DW_AT_name("ISEM")
	.dwattr $C$DW$397, DW_AT_TI_symbol_name("ISEM")
	.dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
	.dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$397, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/cslr_sem.h")
	.dwattr $C$DW$397, DW_AT_decl_line(0x36)
	.dwattr $C$DW$397, DW_AT_decl_column(0x15)

$C$DW$398	.dwtag  DW_TAG_member
	.dwattr $C$DW$398, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$398, DW_AT_name("QSEM")
	.dwattr $C$DW$398, DW_AT_TI_symbol_name("QSEM")
	.dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
	.dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$398, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/cslr_sem.h")
	.dwattr $C$DW$398, DW_AT_decl_line(0x37)
	.dwattr $C$DW$398, DW_AT_decl_column(0x15)

$C$DW$399	.dwtag  DW_TAG_member
	.dwattr $C$DW$399, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$399, DW_AT_name("SEMFLAGL_CLEAR")
	.dwattr $C$DW$399, DW_AT_TI_symbol_name("SEMFLAGL_CLEAR")
	.dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x400]
	.dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$399, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/cslr_sem.h")
	.dwattr $C$DW$399, DW_AT_decl_line(0x38)
	.dwattr $C$DW$399, DW_AT_decl_column(0x15)

$C$DW$400	.dwtag  DW_TAG_member
	.dwattr $C$DW$400, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$400, DW_AT_name("SEMFLAGH_CLEAR")
	.dwattr $C$DW$400, DW_AT_TI_symbol_name("SEMFLAGH_CLEAR")
	.dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x440]
	.dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$400, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/cslr_sem.h")
	.dwattr $C$DW$400, DW_AT_decl_line(0x39)
	.dwattr $C$DW$400, DW_AT_decl_column(0x15)

$C$DW$401	.dwtag  DW_TAG_member
	.dwattr $C$DW$401, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$401, DW_AT_name("SEMFLAGL_SET")
	.dwattr $C$DW$401, DW_AT_TI_symbol_name("SEMFLAGL_SET")
	.dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x480]
	.dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$401, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/cslr_sem.h")
	.dwattr $C$DW$401, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$401, DW_AT_decl_column(0x15)

$C$DW$402	.dwtag  DW_TAG_member
	.dwattr $C$DW$402, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$402, DW_AT_name("SEMFLAGH_SET")
	.dwattr $C$DW$402, DW_AT_TI_symbol_name("SEMFLAGH_SET")
	.dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c0]
	.dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$402, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/cslr_sem.h")
	.dwattr $C$DW$402, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$402, DW_AT_decl_column(0x15)

$C$DW$403	.dwtag  DW_TAG_member
	.dwattr $C$DW$403, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$403, DW_AT_name("SEMERR")
	.dwattr $C$DW$403, DW_AT_TI_symbol_name("SEMERR")
	.dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x500]
	.dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$403, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/cslr_sem.h")
	.dwattr $C$DW$403, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$403, DW_AT_decl_column(0x15)

$C$DW$404	.dwtag  DW_TAG_member
	.dwattr $C$DW$404, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$404, DW_AT_name("SEMERR_CLEAR")
	.dwattr $C$DW$404, DW_AT_TI_symbol_name("SEMERR_CLEAR")
	.dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x504]
	.dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$404, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/cslr_sem.h")
	.dwattr $C$DW$404, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$404, DW_AT_decl_column(0x15)

$C$DW$405	.dwtag  DW_TAG_member
	.dwattr $C$DW$405, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$405, DW_AT_name("SEMERR_SET")
	.dwattr $C$DW$405, DW_AT_TI_symbol_name("SEMERR_SET")
	.dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x508]
	.dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$405, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/cslr_sem.h")
	.dwattr $C$DW$405, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$405, DW_AT_decl_column(0x15)

	.dwattr $C$DW$T$83, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/cslr_sem.h")
	.dwattr $C$DW$T$83, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$T$83, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$83

$C$DW$T$286	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$286, DW_AT_name("CSL_SemRegs")
	.dwattr $C$DW$T$286, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$T$286, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$286, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/cslr_sem.h")
	.dwattr $C$DW$T$286, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$T$286, DW_AT_decl_column(0x03)


$C$DW$T$85	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$85, DW_AT_byte_size(0x124)
$C$DW$406	.dwtag  DW_TAG_member
	.dwattr $C$DW$406, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$406, DW_AT_name("EMIF_MOD_ID_REV")
	.dwattr $C$DW$406, DW_AT_TI_symbol_name("EMIF_MOD_ID_REV")
	.dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$406, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/emif4/V3/cslr_emif4f.h")
	.dwattr $C$DW$406, DW_AT_decl_line(0x36)
	.dwattr $C$DW$406, DW_AT_decl_column(0x15)

$C$DW$407	.dwtag  DW_TAG_member
	.dwattr $C$DW$407, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$407, DW_AT_name("STATUS")
	.dwattr $C$DW$407, DW_AT_TI_symbol_name("STATUS")
	.dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$407, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/emif4/V3/cslr_emif4f.h")
	.dwattr $C$DW$407, DW_AT_decl_line(0x37)
	.dwattr $C$DW$407, DW_AT_decl_column(0x15)

$C$DW$408	.dwtag  DW_TAG_member
	.dwattr $C$DW$408, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$408, DW_AT_name("SDRAM_CONFIG")
	.dwattr $C$DW$408, DW_AT_TI_symbol_name("SDRAM_CONFIG")
	.dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$408, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/emif4/V3/cslr_emif4f.h")
	.dwattr $C$DW$408, DW_AT_decl_line(0x38)
	.dwattr $C$DW$408, DW_AT_decl_column(0x15)

$C$DW$409	.dwtag  DW_TAG_member
	.dwattr $C$DW$409, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$409, DW_AT_name("SDRAM_CONFIG_2")
	.dwattr $C$DW$409, DW_AT_TI_symbol_name("SDRAM_CONFIG_2")
	.dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$409, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/emif4/V3/cslr_emif4f.h")
	.dwattr $C$DW$409, DW_AT_decl_line(0x39)
	.dwattr $C$DW$409, DW_AT_decl_column(0x15)

$C$DW$410	.dwtag  DW_TAG_member
	.dwattr $C$DW$410, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$410, DW_AT_name("SDRAM_REF_CTRL")
	.dwattr $C$DW$410, DW_AT_TI_symbol_name("SDRAM_REF_CTRL")
	.dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$410, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/emif4/V3/cslr_emif4f.h")
	.dwattr $C$DW$410, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$410, DW_AT_decl_column(0x15)

$C$DW$411	.dwtag  DW_TAG_member
	.dwattr $C$DW$411, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$411, DW_AT_name("SDRAM_REF_CTRL_SHDW")
	.dwattr $C$DW$411, DW_AT_TI_symbol_name("SDRAM_REF_CTRL_SHDW")
	.dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$411, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/emif4/V3/cslr_emif4f.h")
	.dwattr $C$DW$411, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$411, DW_AT_decl_column(0x15)

$C$DW$412	.dwtag  DW_TAG_member
	.dwattr $C$DW$412, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$412, DW_AT_name("SDRAM_TIM_1")
	.dwattr $C$DW$412, DW_AT_TI_symbol_name("SDRAM_TIM_1")
	.dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$412, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/emif4/V3/cslr_emif4f.h")
	.dwattr $C$DW$412, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$412, DW_AT_decl_column(0x15)

$C$DW$413	.dwtag  DW_TAG_member
	.dwattr $C$DW$413, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$413, DW_AT_name("SDRAM_TIM_1_SHDW")
	.dwattr $C$DW$413, DW_AT_TI_symbol_name("SDRAM_TIM_1_SHDW")
	.dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$413, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/emif4/V3/cslr_emif4f.h")
	.dwattr $C$DW$413, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$413, DW_AT_decl_column(0x15)

$C$DW$414	.dwtag  DW_TAG_member
	.dwattr $C$DW$414, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$414, DW_AT_name("SDRAM_TIM_2")
	.dwattr $C$DW$414, DW_AT_TI_symbol_name("SDRAM_TIM_2")
	.dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$414, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/emif4/V3/cslr_emif4f.h")
	.dwattr $C$DW$414, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$414, DW_AT_decl_column(0x15)

$C$DW$415	.dwtag  DW_TAG_member
	.dwattr $C$DW$415, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$415, DW_AT_name("SDRAM_TIM_2_SHDW")
	.dwattr $C$DW$415, DW_AT_TI_symbol_name("SDRAM_TIM_2_SHDW")
	.dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$415, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/emif4/V3/cslr_emif4f.h")
	.dwattr $C$DW$415, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$415, DW_AT_decl_column(0x15)

$C$DW$416	.dwtag  DW_TAG_member
	.dwattr $C$DW$416, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$416, DW_AT_name("SDRAM_TIM_3")
	.dwattr $C$DW$416, DW_AT_TI_symbol_name("SDRAM_TIM_3")
	.dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$416, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/emif4/V3/cslr_emif4f.h")
	.dwattr $C$DW$416, DW_AT_decl_line(0x40)
	.dwattr $C$DW$416, DW_AT_decl_column(0x15)

$C$DW$417	.dwtag  DW_TAG_member
	.dwattr $C$DW$417, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$417, DW_AT_name("SDRAM_TIM_3_SHDW")
	.dwattr $C$DW$417, DW_AT_TI_symbol_name("SDRAM_TIM_3_SHDW")
	.dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$417, DW_AT_decl_file("/oe/bld/build-CORTEX_1/arago-tmp-external-linaro-toolchain/work/c667x_evm-linux-gnueabi/platform-lib-rtos/03.01.04.10-r0.0.tisdk-int0/recipe-sysroot/usr/share/ti/ti-pdk-tree/packages/./ti/csl/src/ip/emif4/V3/cslr_emif4f.h")
	.dwattr $C$DW$417, DW_AT_decl_line(0x41)
	.dwattr $C$DW$417, DW_AT_decl_column(0x15)

$C$DW$418	.dwtag  DW_TAG_member
	.dwattr $C$DW$418, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$418, DW_AT_name("LPDDR2_NVM_TIM")
	.dwattr $C$DW$418, DW_AT_TI_symbol_name("LPDDR2_NVM_TIM")
	.dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
